test/dummy/app/controllers/albums_controller.rb

  def show
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE ("albums"."id" = 1) LIMIT 1